GreatCowBASIC/DATFileGenerator/incfiles/p16F17545.inc
;-----Bank62------------------
IOCWP            EQU  H'1ECD'
IOCWN            EQU  H'1ECE'
IOCWF            EQU  H'1ECF'
RB4I2C           EQU  H'1EE5'
RB5I2C           EQU  H'1EE6'
RB6I2C           EQU  H'1EE7'
RB7I2C           EQU  H'1EE8'
UMTOAP           EQU  H'1F0C'
UMTOAL           EQU  H'1F0D'
UMTOAH           EQU  H'1F0E'
PORTW            EQU  H'1F22'
LATW             EQU  H'1F23'
PORTWIN0         EQU  H'1F24'
PORTWIN1         EQU  H'1F25'
PORTWIN2         EQU  H'1F26'
PORTWIN3         EQU  H'1F27'
PORTWIN4         EQU  H'1F28'
PORTWIN5         EQU  H'1F29'
PORTWIN6         EQU  H'1F2A'
PORTWIN7         EQU  H'1F2B'
PORTWCLK         EQU  H'1F2C'
PORTWDF          EQU  H'1F2D'
PORTWCON         EQU  H'1F2E'

;-----Bank63------------------
APMCON           EQU  H'1F4C'
APMPRE           EQU  H'1F4D'
APMPREL          EQU  H'1F4D'
APMPREH          EQU  H'1F4E'
APMPER           EQU  H'1F4F'
APMPERL          EQU  H'1F4F'
APMPERH          EQU  H'1F50'
APMSTART1        EQU  H'1F51'
APMSTART1L       EQU  H'1F51'
APMSTART1H       EQU  H'1F52'
APMPERS1         EQU  H'1F53'
APMPERS1L        EQU  H'1F53'
APMPERS1H        EQU  H'1F54'
APMPERS1U        EQU  H'1F55'
APMSTART2        EQU  H'1F56'
APMSTART2L       EQU  H'1F56'
APMSTART2H       EQU  H'1F57'
APMSTART2U       EQU  H'1F58'
APMPERS2         EQU  H'1F59'
APMPERS2L        EQU  H'1F59'
APMPERS2H        EQU  H'1F5A'
APMPERS2U        EQU  H'1F5B'
APMEND1          EQU  H'1F5C'
APMEND1L         EQU  H'1F5C'
APMEND1H         EQU  H'1F5D'
APMEND1U         EQU  H'1F5E'
APMPERE1         EQU  H'1F5F'
APMPERE1L        EQU  H'1F5F'
APMPERE1H        EQU  H'1F60'
APMPERE1U        EQU  H'1F61'
APMEND2          EQU  H'1F62'
APMEND2L         EQU  H'1F62'
APMEND2H         EQU  H'1F63'
APMEND2U         EQU  H'1F64'
APMPERE2         EQU  H'1F65'
APMPERE2L        EQU  H'1F65'
APMPERE2H        EQU  H'1F66'
APMPERE2U        EQU  H'1F67'
APMCLK           EQU  H'1F68'
APMSTATUS        EQU  H'1F69'
APMSTATUSL       EQU  H'1F69'
APMSTATUSH       EQU  H'1F6A'
APMSTATUSU       EQU  H'1F6B'

;-----Bank64------------------
STATUS_SHAD      EQU  H'1FE4'
WREG_SHAD        EQU  H'1FE5'
BSR_SHAD         EQU  H'1FE6'
PCLATH_SHAD      EQU  H'1FE7'
FSR0_SHAD        EQU  H'1FE8'
FSR0L_SHAD       EQU  H'1FE8'
FSR0H_SHAD       EQU  H'1FE9'
FSR1_SHAD        EQU  H'1FEA'
FSR1L_SHAD       EQU  H'1FEA'
FSR1H_SHAD       EQU  H'1FEB'
STKPTR           EQU  H'1FED'
TOSL             EQU  H'1FEE'
TOSH             EQU  H'1FEF'


;----- PIR1 Bits -----------------------------------------------------
NVMIF            EQU  H'0000'
CRCIF            EQU  H'0001'
SCANIF           EQU  H'0002'
ACTIF            EQU  H'0003'
CSWIF            EQU  H'0004'
OSFIF            EQU  H'0005'
TMR1IF           EQU  H'0006'
TMR1GIF          EQU  H'0007'


;----- PIE1 Bits -----------------------------------------------------
NVMIE            EQU  H'0000'
CRCIE            EQU  H'0001'
SCANIE           EQU  H'0002'
ACTIE            EQU  H'0003'
CSWIE            EQU  H'0004'
OSFIE            EQU  H'0005'
TMR1IE           EQU  H'0006'
TMR1GIE          EQU  H'0007'


;----- PMD1 Bits -----------------------------------------------------
TMR1MD           EQU  H'0000'
TMR3MD           EQU  H'0001'
TMR2MD           EQU  H'0002'
TMR4MD           EQU  H'0003'
CCP1MD           EQU  H'0005'
CCP2MD           EQU  H'0006'
PWM1MD           EQU  H'0007'


;----- OSCCON1 Bits -----------------------------------------------------
NDIV0            EQU  H'0000'
NDIV1            EQU  H'0001'
NDIV2            EQU  H'0002'
NDIV3            EQU  H'0003'
NOSC0            EQU  H'0004'
NOSC1            EQU  H'0005'
NOSC2            EQU  H'0006'


;----- TMR1 Bits -----------------------------------------------------
TMR1L0           EQU  H'0000'
TMR1L1           EQU  H'0001'
TMR1L2           EQU  H'0002'
TMR1L3           EQU  H'0003'
TMR1L4           EQU  H'0004'
TMR1L5           EQU  H'0005'
TMR1L6           EQU  H'0006'
TMR1L7           EQU  H'0007'
TMR10_TMR1       EQU  H'0000'
TMR11_TMR1       EQU  H'0001'
TMR12_TMR1       EQU  H'0002'
TMR13_TMR1       EQU  H'0003'
TMR14_TMR1       EQU  H'0004'
TMR15_TMR1       EQU  H'0005'
TMR16_TMR1       EQU  H'0006'
TMR17_TMR1       EQU  H'0007'
CAL01            EQU  H'0000'
CAL11            EQU  H'0001'
CAL21            EQU  H'0002'
CAL31            EQU  H'0003'
CAL41            EQU  H'0004'
CAL51            EQU  H'0005'
CAL61            EQU  H'0006'
CAL71            EQU  H'0007'


;----- TMR1H Bits -----------------------------------------------------
TMR1H0           EQU  H'0000'
TMR1H1           EQU  H'0001'
TMR1H2           EQU  H'0002'
TMR1H3           EQU  H'0003'
TMR1H4           EQU  H'0004'
TMR1H5           EQU  H'0005'
TMR1H6           EQU  H'0006'
TMR1H7           EQU  H'0007'
TMR18_TMR1H      EQU  H'0000'
TMR19_TMR1H      EQU  H'0001'
TMR110           EQU  H'0002'
TMR111           EQU  H'0003'
TMR112           EQU  H'0004'
TMR113           EQU  H'0005'
TMR114           EQU  H'0006'
TMR115           EQU  H'0007'


;----- T1CON Bits -----------------------------------------------------
ON_T1CON         EQU  H'0000'
RD16             EQU  H'0001'
NSYNC            EQU  H'0002'
TMR1ON           EQU  H'0000'
T1RD16           EQU  H'0001'
NT1SYNC          EQU  H'0002'
T1CKPS0          EQU  H'0004'
T1CKPS1          EQU  H'0005'
CKPS0_T1CON      EQU  H'0004'
CKPS1_T1CON      EQU  H'0005'
RD161            EQU  H'0001'


;----- T1GCON Bits -----------------------------------------------------
GVAL             EQU  H'0002'
GGO_NDONE        EQU  H'0003'
GSPM             EQU  H'0004'
GTM              EQU  H'0005'
GPOL             EQU  H'0006'
GE               EQU  H'0007'
T1GVAL           EQU  H'0002'
T1GGO_NDONE      EQU  H'0003'
T1GSPM           EQU  H'0004'
T1GTM            EQU  H'0005'
T1GPOL           EQU  H'0006'
T1GE             EQU  H'0007'
T1GGO            EQU  H'0003'


;----- T1GATE Bits -----------------------------------------------------
GSS0             EQU  H'0000'
GSS1             EQU  H'0001'
GSS2             EQU  H'0002'
GSS3             EQU  H'0003'
GSS4             EQU  H'0004'
T1GSS0           EQU  H'0000'
T1GSS1           EQU  H'0001'
T1GSS2           EQU  H'0002'
T1GSS3           EQU  H'0003'
T1GSS4           EQU  H'0004'


;----- T1CLK Bits -----------------------------------------------------
T1CS0            EQU  H'0000'
T1CS1            EQU  H'0001'
T1CS2            EQU  H'0002'
T1CS3            EQU  H'0003'
T1CS4            EQU  H'0004'
CS0_T1CLK        EQU  H'0000'
CS1_T1CLK        EQU  H'0001'
CS2_T1CLK        EQU  H'0002'
CS3              EQU  H'0003'
CS4              EQU  H'0004'


;----- CCP1CON Bits -----------------------------------------------------
FMT              EQU  H'0004'
OUT_CCP1CON      EQU  H'0005'
EN               EQU  H'0007'
MODE0            EQU  H'0000'
MODE1            EQU  H'0001'
MODE2            EQU  H'0002'
MODE3            EQU  H'0003'
CCP1FMT          EQU  H'0004'
CCP1OUT          EQU  H'0005'
CCP1EN           EQU  H'0007'
CCP1MODE0        EQU  H'0000'
CCP1MODE1        EQU  H'0001'
CCP1MODE2        EQU  H'0002'
CCP1MODE3        EQU  H'0003'
P1M1             EQU  H'0007'


;----- CCP1CAP Bits -----------------------------------------------------
CTS0             EQU  H'0000'
CTS1             EQU  H'0001'
CTS2             EQU  H'0002'
CTS3             EQU  H'0003'
CCP1CTS0         EQU  H'0000'
CCP1CTS1         EQU  H'0001'
CCP1CTS2         EQU  H'0002'
CCP1CTS3         EQU  H'0003'


